       identification division.
       program-id. environment_setup_01.

       procedure division.
           display "Hello World!".
           stop run.

