       identification division.
       program-id. loop_statements_04.

       procedure division.
			 a-para.
				   perform b-para 3 times.
				   stop run.

			 b-para.
				   display 'in b-para'.
