//JCOMPCOB JOB IBMUSERB,MSGCLASS=A,CLASS=C,NOTIFY=ALUNOU8
//IGYWCLG PROC SYSLBLK=3200,
//             LIBPRFX='CEE'
//*
//COBOL  EXEC  PGM=IGYCRCTL,REGION=2048K,
//        PARM=(LIST,MAP,APOST,DYNAM)
//SYSPRINT DD  SYSOUT=*
//STEPLIB  DD  DISP=SHR,DSN=IGY.V2R1M0.SIGYCOMP
//SYSLIN   DD  DSNAME=&&LOADSET,UNIT=SYSDA,
//             DISP=(MOD,PASS),SPACE=(TRK,(3,3)),
//             DCB=(BLKSIZE=&SYSLBLK)
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT4   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT5   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT6   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT7   DD  UNIT=SYSDA,SPACE=(CYL,(1,1))
//LKED   EXEC PGM=HEWL,COND=(4,LT,COBOL),REGION=1024K
//SYSLIB   DD  DSNAME=&LIBPRFX..SCEELKED,DISP=SHR
//         DD DSN=CSF.SCSFMOD0,DISP=SHR
//         DD DSN=IBMUSER.PGMS.LOADLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSLIN   DD  DSNAME=&&LOADSET,DISP=(OLD,DELETE)
//         DD  DDNAME=SYSIN
//SYSLMOD  DD DSN=FUTURE.LMODUL.COBOL(PU8EXE03),DISP=SHR
//SYSUT1   DD  UNIT=SYSDA,SPACE=(TRK,(10,10))
//STEPLIB  DD  DSNAME=&LIBPRFX..SCEERUN,DISP=SHR
//SYSPRINT DD  SYSOUT=A
//CEEDUMP  DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=A
//         PEND
//COBGO    EXEC  IGYWCLG
//COBOL.SYSIN DD DSN=ALUNOU8.FONTES.COBOL(PU8EXE03),DISP=SHR
