//JU8EXE19 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE19
//*
//* GERAR: - LISTAGEM DOS CORRENTISTAS
//*        - CONTACORRENTE ATUALIZADO
//*
//CTCORABC DD DSN=FUTURE.ARQUIVOS.CTCORABC,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//CTCORXYZ DD DSN=FUTURE.ARQUIVOS.CTCORXYZ,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//CTCORGER DD DSN=FUTURE.ARQUIVOS.CTCORGER,
//**          DISP=SHR,
//            DISP=(,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=500),
//            SPACE=(TRK,(3,3),RLSE),
//            UNIT=3390
//RELATO   DD SYSOUT=T,
//            DCB=(LRECL=58,RECFM=FBA)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
