//JU8EXE13 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE13
//*
//* GERAR RELATORIO DE FUNCIONARIOS POR SECAO
//*
//CADFUNC  DD DSN=FUTURE.ARQUIVOS.CADFUNC.EXER0013,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//RELATO   DD SYSOUT=T,
//            DCB=(LRECL=67,RECFM=FBA)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
