//JU8EXE20 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE20
//*
//* GERAR: - ARQUIVO DE SALARIOS POR DEPARTAMENTO
//*        - LISTAGEM DO CADASTRO DE FUNCIONARIOS POR DEPARTAMENTO
//*
//CADFUN   DD DSN=FUTURE.ARQUIVOS.CADFUN,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//ARQSAL   DD DSN=FUTURE.ARQUIVOS.ARQSAL,
//            DISP=SHR,
//**          DISP=(,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=20,BLKSIZE=500),
//            SPACE=(TRK,(3,3),RLSE),
//            UNIT=3390
//RELATO   DD SYSOUT=T,
//            DCB=(LRECL=94,RECFM=FBA)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
