//JU8EXE18 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE18
//*
//* BALANCE LINE ENTRE OS ARQUIVOS CADMAT (ANTERIOR E NOVO)
//*
//CADMATAN DD DSN=FUTURE.ARQUIVOS.CADMATAN,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//CADMATNO DD DSN=FUTURE.ARQUIVOS.CADMATNO,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//CADMATAT DD DSN=FUTURE.ARQUIVOS.CADMATAT,
//            DISP=(,CATLG,DELETE),
//**          DISP=SHR,
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=500),
//            SPACE=(TRK,(3,3),RLSE),
//            UNIT=3390
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*
