//JU8EXE10 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE10
//*
//* EMISSAO DO RELATORIO DO CADASTRO DE ALUNOS POR TURMA
//*
//CADALUNO DD DSN=FUTURE.ARQUIVOS.CADALUNO,
//       DISP=SHR,
//       VOL=SER=PR39D7,
//       UNIT=3390
//RELATO   DD SYSOUT=T,
//       DCB=(LRECL=60,RECFM=FBA)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
