//JU8EXE16 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE16
//*
//* GERAR: - RELATORIO DE INCOSISTENCIA
//*        - CADASTRO DE PECAS ATUALIZADO
//*
//CADPECA  DD DSN=FUTURE.ARQUIVOS.CADPECA.EXER0016,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//CADATU   DD DSN=FUTURE.ARQUIVOS.CADATU.EXER0016,
//            DISP=SHR,
//**          DISP=(,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=500),
//            SPACE=(TRK,(5,5),RLSE),
//            UNIT=3390
//RELATO   DD SYSOUT=T,
//            DCB=(LRECL=78,RECFM=FBA)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
