//JU8EXE04 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE04
//*
//* GERAR ARQUIVO DE PECAS SELECIONADAS
//*
//CADPECA  DD DSN=FUTURE.ARQUIVOS.CADPECA,
//       DISP=SHR,
//       VOL=SER=PR39C7,
//       UNIT=3390
//CADSEL   DD DSN=ALUNOU8.ARQUIVOS.CADSEL.EXER0004,
//       DISP=(NEW,CATLG,DELETE),
//***    DISP=SHR,
//       DCB=(RECFM=FB,LRECL=50,BLKSIZE=500),
//       SPACE=(TRK,(3,3),RLSE),
//       UNIT=3390
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*