//JU8EXE09 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE09
//*
//* GERAR ARQUIVO DE COTACOES SELECIONADAS E DESPREZADAS
//*
//CADCOTA  DD DSN=FUTURE.ARQUIVOS.CADCOTA,
//       DISP=SHR,
//       VOL=SER=PR39D7,
//       UNIT=3390
//COTASELE DD DSN=FUTURE.ARQUIVOS.COTASELE,
//       DISP=(,CATLG,DELETE),
//       DCB=(RECFM=FB,LRECL=40,BLKSIZE=400),
//       SPACE=(TRK,(3,3),RLSE),
//       UNIT=3390
//COTADESP DD DSN=FUTURE.ARQUIVOS.COTADESP,
//       DISP=(,CATLG,DELETE),
//       DCB=(RECFM=FB,LRECL=40,BLKSIZE=400),
//       SPACE=(TRK,(3,3),RLSE),
//       UNIT=3390
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*
