//JU8EXE06 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE06
//*
//* EMISSAO DO RELATORIO ANALITICO DO CADASTRO DE PECAS
//*
//CADPECA  DD DSN=FUTURE.ARQUIVOS.CADPECA,
//       DISP=SHR,
//       VOL=SER=PR39C7,
//       UNIT=3390
//RELATO   DD SYSOUT=T,
//       DCB=(LRECL=104,RECFM=FBA)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y