//JU8EXE15 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(0,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE15
//*
//* GERAR: - RELATORIO DE MOVIMENTACAO DE FUNCIONARIOS
//*        - GERAR ARQUIVO DE FUNCIONARIOS INCONSISTENTES
//*        - GERAR ARQUIVO DE FUNCIONARIOS CONSISTENTES
//*
//CADFUNC  DD DSN=FUTURE.ARQUIVOS.CADFUNC,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//FUNCINCO DD DSN=ALUNOU8.ARQUIVOS.FUNCINCO.EXER0015,
//**          DISP=SHR,
//            DISP=(,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=35,BLKSIZE=350),
//            SPACE=(TRK,(3,3),RLSE),
//            UNIT=3390
//FUNCOK   DD DSN=ALUNOU8.ARQUIVOS.FUNCOK.EXER0015,
//**          DISP=SHR,
//            DISP=(,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=35,BLKSIZE=350),
//            SPACE=(TRK,(3,3),RLSE),
//            UNIT=3390
//RELATO   DD SYSOUT=T,
//            DCB=(LRECL=78,RECFM=FBA)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
