//JU8EXE02 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE02
//*
//* GERAR ARQUIVO DE PECAS (BACKU-UP)
//*
//CADPECA  DD DSN=FUTURE.ARQUIVOS.CADPECA,
//       DISP=SHR,
//       VOL=SER=PR39C7,
//       UNIT=3390
//CADATU   DD DSN=ALUNOU8.ARQUIVOS.CADATU.EXER0002,
//       DISP=(NEW,CATLG,DELETE),
//***    DISP=SHR,
//       DCB=(RECFM=FB,LRECL=60,BLKSIZE=600),
//       SPACE=(TRK,(3,3),RLSE),
//       UNIT=3390
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*