//JU8EXE08 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE08
//*
//* LISTAGEM ANALITICA DO CADASTRO DE MATERIAIS
//*
//CADMAT   DD DSN=FUTURE.ARQUIVOS.CADMAT.EXER0008,
//       DISP=SHR,
//       VOL=SER=PR39D7,
//       UNIT=3390
//RELATO   DD SYSOUT=T,
//       DCB=(LRECL=82,RECFM=FBA)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
