//JU8EXE12 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE12
//*
//* GERAR: - RELATORIO DO CADASTRO DE MATERIAIS
//*        - CADASTRO DE CONTAS
//*
//CADMAT   DD DSN=FUTURE.ARQUIVOS.CADMAT.EXER0012,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//CADCONTA DD DSN=ALUNOU8.ARQUIVOS.CADCONTA.EXER0012,
//**          DISP=SHR,
//            DISP=(,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=30,BLKSIZE=300),
//            SPACE=(TRK,(3,3),RLSE),
//            UNIT=3390
//CADMATU  DD DSN=ALUNOU8.ARQUIVOS.CADMATU,
//**          DISP=SHR,
//            DISP=(,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=500),
//            SPACE=(TRK,(3,3),RLSE),
//            UNIT=3390
//RELATO   DD SYSOUT=T,
//            DCB=(LRECL=86,RECFM=FBA)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
