//JU8EXE17 JOB IBMUSERA,MSGCLASS=A,CLASS=A,NOTIFY=ALUNOU8,TIME=(0,01)
//JOBLIB   DD DISP=SHR,DSN=FUTURE.LMODUL.COBOL
//*
//STEP1    EXEC PGM=PU8EXE17
//*
//* GERAR: - ARQUIVO DE MATERIAIS DESPREZADOS E SELECIONADOS
//*
//CADMAT   DD DSN=FUTURE.ARQUIVOS.CADMAT.EXER0017,
//            DISP=SHR,
//            VOL=SER=PR39D7,
//            UNIT=3390
//MATDES   DD DSN=FUTURE.ARQUIVOS.MATDES.EXER0017,
//**          DISP=SHR,
//            DISP=(,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=500),
//            SPACE=(TRK,(3,3),RLSE),
//            UNIT=3390
//MATSEL   DD DSN=FUTURE.ARQUIVOS.MATSEL.EXER0017,
//**          DISP=SHR,
//            DISP=(,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=70,BLKSIZE=700),
//            SPACE=(TRK,(3,3),RLSE),
//            UNIT=3390
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
//*
